[Timeout] BlockStatement
domain/models/application/uniqueId.ts:5:30
 import {ValueObject} from "../tactic/valueObject";
 
 export class UniqueId extends ValueObject {
-    constructor(id?: string) {
-        super();
-        if (id && typeof id === 'string') {
-            this.value = id;
-        } else {
-            this.value = uuidv4();
-        }
-    }
+    constructor(id?: string) {}
 
     getValue(): any {

[Timeout] ConditionalExpression
domain/models/application/uniqueId.ts:7:19
 export class UniqueId extends ValueObject {
     constructor(id?: string) {
         super();
-        if (id && typeof id === 'string') {
+        if (id && false) {
             this.value = id;
         } else {

[Timeout] ConditionalExpression
domain/models/application/uniqueId.ts:7:13
 export class UniqueId extends ValueObject {
     constructor(id?: string) {
         super();
-        if (id && typeof id === 'string') {
+        if (false) {
             this.value = id;
         } else {

[Timeout] BlockStatement
domain/models/application/uniqueId.ts:9:16
         super();
         if (id && typeof id === 'string') {
             this.value = id;
-        } else {
-            this.value = uuidv4();
-        }
+        } else {}
     }
 

[Timeout] BlockStatement
domain/models/application/uniqueId.ts:14:21
         }
     }
 
-    getValue(): any {
-        return super.getValue();
-    }
+    getValue(): any {}
 }
 
