[Timeout] BlockStatement
domain/models/business/marketCap.ts:6:38
 export class MarketCap {
     private readonly listProduct: Product[] = [];
 
-    constructor(products: Product[]) {
-        this.listProduct = products;
-    }
+    constructor(products: Product[]) {}
 
     retrieveAllProduct() {

[Timeout] BlockStatement
domain/models/business/marketCap.ts:10:26
         this.listProduct = products;
     }
 
-    retrieveAllProduct() {
-        return this.listProduct;
-    }
+    retrieveAllProduct() {}
 
     remove(product: Product) {

[Timeout] BlockStatement
domain/models/business/marketCap.ts:14:30
         return this.listProduct;
     }
 
-    remove(product: Product) {
-        const productIndex = this.listProduct.findIndex(p => p.equals(product));
-        this.listProduct.splice(productIndex, 1);
-    }
+    remove(product: Product) {}
 }
 

[Timeout] ArrowFunction
domain/models/business/marketCap.ts:15:57
     }
 
     remove(product: Product) {
-        const productIndex = this.listProduct.findIndex(p => p.equals(product));
+        const productIndex = this.listProduct.findIndex(() => undefined);
         this.listProduct.splice(productIndex, 1);
     }
