[Timeout] BlockStatement
domain/models/business/money.ts:8:68
     private readonly amount: number;
     private readonly currency: Currency;
 
-    constructor(price: number, currency: Currency = Currency.euro) {
-        super();
-        this.amount = price;
-        this.currency = currency;
-    }
+    constructor(price: number, currency: Currency = Currency.euro) {}
 
     isGreaterOrEqualsThan(money: Money): boolean {

[Timeout] BlockStatement
domain/models/business/money.ts:14:50
         this.currency = currency;
     }
 
-    isGreaterOrEqualsThan(money: Money): boolean {
-        return this.amount > money.amount;
-    }
+    isGreaterOrEqualsThan(money: Money): boolean {}
 
     retrieveAmount() {

[Timeout] ConditionalExpression
domain/models/business/money.ts:15:16
     }
 
     isGreaterOrEqualsThan(money: Money): boolean {
-        return this.amount > money.amount;
+        return true;
     }
 

[Timeout] ConditionalExpression
domain/models/business/money.ts:15:16
     }
 
     isGreaterOrEqualsThan(money: Money): boolean {
-        return this.amount > money.amount;
+        return false;
     }
 

[Timeout] BlockStatement
domain/models/business/money.ts:18:22
         return this.amount > money.amount;
     }
 
-    retrieveAmount() {
-        return this.amount;
-    }
+    retrieveAmount() {}
 }
 
