[Timeout] BlockStatement
domain/models/business/product.ts:14:52
     readonly name: string;
     readonly price: Money;
 
-    constructor(newProduct: Partial<ProductProps>) {
-        super(newProduct.id);
-        this.name = newProduct.name;
-        this.price = new Money(newProduct.price);
-    }
+    constructor(newProduct: Partial<ProductProps>) {}
 
     isGreaterOrEqualsThan(product: Product): boolean {

[Timeout] BlockStatement
domain/models/business/product.ts:20:54
         this.price = new Money(newProduct.price);
     }
 
-    isGreaterOrEqualsThan(product: Product): boolean {
-        return this.price.isGreaterOrEqualsThan(product.price);
-    }
+    isGreaterOrEqualsThan(product: Product): boolean {}
 
     retrieveName() {

[Timeout] BlockStatement
domain/models/business/product.ts:24:20
         return this.price.isGreaterOrEqualsThan(product.price);
     }
 
-    retrieveName() {
-        return this.name;
-    }
+    retrieveName() {}
 
     retrievePrice() {

[Timeout] BlockStatement
domain/models/business/product.ts:28:21
         return this.name;
     }
 
-    retrievePrice() {
-        return this.price.retrieveAmount();
-    }
+    retrievePrice() {}
 }
 
