[Timeout] BlockStatement
domain/models/business/vault.ts:9:25
         super();
     }
 
-    getAll(): Product[] {
-        return this.listProducts;
-    }
+    getAll(): Product[] {}
 
     retrieveMostExpensive(): Product {

[Timeout] BlockStatement
domain/models/business/vault.ts:13:38
         return this.listProducts;
     }
 
-    retrieveMostExpensive(): Product {
-        const _vault = this.listProducts;
-        _vault.sort((a, b) => {
-            if (b.isGreaterOrEqualsThan(a)) return 1;
-            if (a.isGreaterOrEqualsThan(b)) return -1;
-            return 0;
-        });
-        return _vault[0];
-    }
+    retrieveMostExpensive(): Product {}
 
     store(product: Product) {

[Timeout] BlockStatement
domain/models/business/vault.ts:15:31
 
     retrieveMostExpensive(): Product {
         const _vault = this.listProducts;
-        _vault.sort((a, b) => {
-            if (b.isGreaterOrEqualsThan(a)) return 1;
-            if (a.isGreaterOrEqualsThan(b)) return -1;
-            return 0;
-        });
+        _vault.sort((a, b) => {});
         return _vault[0];
     }

[Timeout] ConditionalExpression
domain/models/business/vault.ts:16:17
     retrieveMostExpensive(): Product {
         const _vault = this.listProducts;
         _vault.sort((a, b) => {
-            if (b.isGreaterOrEqualsThan(a)) return 1;
+            if (false) return 1;
             if (a.isGreaterOrEqualsThan(b)) return -1;
             return 0;

[Timeout] ConditionalExpression
domain/models/business/vault.ts:16:17
     retrieveMostExpensive(): Product {
         const _vault = this.listProducts;
         _vault.sort((a, b) => {
-            if (b.isGreaterOrEqualsThan(a)) return 1;
+            if (true) return 1;
             if (a.isGreaterOrEqualsThan(b)) return -1;
             return 0;

[Timeout] ConditionalExpression
domain/models/business/vault.ts:17:17
         const _vault = this.listProducts;
         _vault.sort((a, b) => {
             if (b.isGreaterOrEqualsThan(a)) return 1;
-            if (a.isGreaterOrEqualsThan(b)) return -1;
+            if (false) return -1;
             return 0;
         });

[Timeout] UnaryOperator
domain/models/business/vault.ts:17:52
         const _vault = this.listProducts;
         _vault.sort((a, b) => {
             if (b.isGreaterOrEqualsThan(a)) return 1;
-            if (a.isGreaterOrEqualsThan(b)) return -1;
+            if (a.isGreaterOrEqualsThan(b)) return +1;
             return 0;
         });

[Timeout] BlockStatement
domain/models/business/vault.ts:23:29
         return _vault[0];
     }
 
-    store(product: Product) {
-        this.listProducts.push(product);
-    }
+    store(product: Product) {}
 }
 
