[Timeout] BlockStatement
domain/models/business/productReference.ts:11:61
 export class ProductReference extends Aggregate<ProductReference> {
     readonly name: string;
 
-    constructor(newProduct: Partial<ProductReferenceProps>) {
-        super(newProduct.id);
-        this.name = newProduct.name;
-    }
+    constructor(newProduct: Partial<ProductReferenceProps>) {}
 }
 
