[Timeout] BlockStatement
domain/models/business/wallet.ts:4:46
 export class Wallet {
     private balance: number;
 
-    constructor(wallet: { balance: number }) {
-        this.balance = wallet.balance;
-    }
+    constructor(wallet: { balance: number }) {}
 
     retrieveBalance() {

[Timeout] BlockStatement
domain/models/business/wallet.ts:8:23
         this.balance = wallet.balance;
     }
 
-    retrieveBalance() {
-        return this.balance;
-    }
+    retrieveBalance() {}
 
     spend(amount: number) {

[Timeout] BlockStatement
domain/models/business/wallet.ts:12:27
         return this.balance;
     }
 
-    spend(amount: number) {
-        this.balance -= amount;
-    }
+    spend(amount: number) {}
 }
 
