[Timeout] BlockStatement
domain/models/tactic/entity.ts:6:30
 export abstract class Entity<T> {
     protected readonly id: UniqueId;
 
-    constructor(id?: string) {
-        this.id = new UniqueId(id);
-    }
+    constructor(id?: string) {}
 
     equals(otherEntity: Entity<T>): boolean {

[Timeout] BlockStatement
domain/models/tactic/entity.ts:10:45
         this.id = new UniqueId(id);
     }
 
-    equals(otherEntity: Entity<T>): boolean {
-        return this.getId() === otherEntity.getId();
-    }
+    equals(otherEntity: Entity<T>): boolean {}
 
     getId(): string {

[Timeout] EqualityOperator
domain/models/tactic/entity.ts:11:16
     }
 
     equals(otherEntity: Entity<T>): boolean {
-        return this.getId() === otherEntity.getId();
+        return this.getId() !== otherEntity.getId();
     }
 

[Timeout] ConditionalExpression
domain/models/tactic/entity.ts:11:16
     }
 
     equals(otherEntity: Entity<T>): boolean {
-        return this.getId() === otherEntity.getId();
+        return true;
     }
 

[Timeout] BlockStatement
domain/models/tactic/entity.ts:14:21
         return this.getId() === otherEntity.getId();
     }
 
-    getId(): string {
-        return this.id.getValue();
-    }
+    getId(): string {}
 }
 
