[Timeout] BlockStatement
domain/models/tactic/valueObject.ts:4:56
 export abstract class ValueObject {
     protected value: any;
 
-    protected isGreaterOrEqualsThan(vo: this): boolean {
-        throw new Error('Not Implemented Yet! 🚧🚧🚧');
-    }
+    protected isGreaterOrEqualsThan(vo: this): boolean {}
 
     protected getValue() {

[Timeout] BlockStatement
domain/models/tactic/valueObject.ts:8:26
         throw new Error('Not Implemented Yet! 🚧🚧🚧');
     }
 
-    protected getValue() {
-        return this.value;
-    }
+    protected getValue() {}
 }
 
