[Timeout] BlockStatement
src/domain/services/randomProductReferenceProvider.ts:4:18
 export class RandomProductReferenceProvider {
     private unique: number = null;
 
-    nextUnique() {
-        if (this.unique === null) this.unique = 0;
-        else this.unique++;
-    }
+    nextUnique() {}
 
     generate(max: number): number {

[Timeout] ConditionalExpression
src/domain/services/randomProductReferenceProvider.ts:5:13
     private unique: number = null;
 
     nextUnique() {
-        if (this.unique === null) this.unique = 0;
+        if (false) this.unique = 0;
         else this.unique++;
     }

[Timeout] EqualityOperator
src/domain/services/randomProductReferenceProvider.ts:5:13
     private unique: number = null;
 
     nextUnique() {
-        if (this.unique === null) this.unique = 0;
+        if (this.unique !== null) this.unique = 0;
         else this.unique++;
     }

[Timeout] UpdateOperator
src/domain/services/randomProductReferenceProvider.ts:6:14
 
     nextUnique() {
         if (this.unique === null) this.unique = 0;
-        else this.unique++;
+        else this.unique--;
     }
 

[Timeout] BlockStatement
src/domain/services/randomProductReferenceProvider.ts:9:35
         else this.unique++;
     }
 
-    generate(max: number): number {
-        if (this.unique !== null) return this.unique;
-        return Math.floor(Math.random() * max);
-    }
+    generate(max: number): number {}
 }
 

[Timeout] ConditionalExpression
src/domain/services/randomProductReferenceProvider.ts:10:13
     }
 
     generate(max: number): number {
-        if (this.unique !== null) return this.unique;
+        if (true) return this.unique;
         return Math.floor(Math.random() * max);
     }

[Timeout] ConditionalExpression
src/domain/services/randomProductReferenceProvider.ts:10:13
     }
 
     generate(max: number): number {
-        if (this.unique !== null) return this.unique;
+        if (false) return this.unique;
         return Math.floor(Math.random() * max);
     }

[Timeout] ArithmeticOperator
src/domain/services/randomProductReferenceProvider.ts:11:27
 
     generate(max: number): number {
         if (this.unique !== null) return this.unique;
-        return Math.floor(Math.random() * max);
+        return Math.floor(Math.random() / max);
     }
 }
