[Timeout] BlockStatement
src/domain/services/vaultService.ts:8:68
     private vault: Vault = new Vault();
     private listProduct: Product[] = [];
 
-    createProduct(product: {name: string, price: number}): Product {
-        const _newProduct = new Product(product);
-        this.listProduct.push(_newProduct);
-        return _newProduct;
-    }
+    createProduct(product: {name: string, price: number}): Product {}
 
     fillVault() {

[Timeout] BlockStatement
src/domain/services/vaultService.ts:14:17
         return _newProduct;
     }
 
-    fillVault() {
-        this.vault = new Vault(this.listProduct);
-    }
+    fillVault() {}
 
     retrieveVault(): Vault {

[Timeout] BlockStatement
src/domain/services/vaultService.ts:18:28
         this.vault = new Vault(this.listProduct);
     }
 
-    retrieveVault(): Vault {
-        return this.vault;
-    }
+    retrieveVault(): Vault {}
 }
 
