[Timeout] BlockStatement
src/domain/useCase/buyProduct.useCase.ts:8:113
 import {MarketCap} from "../models/business/marketCap";
 
 export class BuyProductUseCase {
-    async execute(product: Product, vault: Vault, wallet: Wallet, marketCap: MarketCap): Promise<void | string> {
-        const balance = wallet.retrieveBalance();
-        const price = product.retrievePrice();
-        if (balance >= price) {
-            wallet.spend(price);
-            vault.store(product);
-            marketCap.remove(product);
-        }
-        else return ErrorMessage.notEnoughMoney;
-    }
+    async execute(product: Product, vault: Vault, wallet: Wallet, marketCap: MarketCap): Promise<void | string> {}
 }
 

[Timeout] ConditionalExpression
src/domain/useCase/buyProduct.useCase.ts:11:13
     async execute(product: Product, vault: Vault, wallet: Wallet, marketCap: MarketCap): Promise<void | string> {
         const balance = wallet.retrieveBalance();
         const price = product.retrievePrice();
-        if (balance >= price) {
+        if (true) {
             wallet.spend(price);
             vault.store(product);

[Timeout] EqualityOperator
src/domain/useCase/buyProduct.useCase.ts:11:13
     async execute(product: Product, vault: Vault, wallet: Wallet, marketCap: MarketCap): Promise<void | string> {
         const balance = wallet.retrieveBalance();
         const price = product.retrievePrice();
-        if (balance >= price) {
+        if (balance < price) {
             wallet.spend(price);
             vault.store(product);
