[Timeout] BlockStatement
src/domain/useCase/generateUniqueProduct.useCase.ts:9:45
     constructor(private productReferenceRepository: Repository<ProductReference>) {
     }
 
-    async execute(product?: {name: string}) {
-        let _product = product
-        if (!_product) _product = await this.productReferenceRepository.retrieveOne();
-        return new Product(_product);
-    }
+    async execute(product?: {name: string}) {}
 }
 

[Timeout] BooleanLiteral
src/domain/useCase/generateUniqueProduct.useCase.ts:11:13
 
     async execute(product?: {name: string}) {
         let _product = product
-        if (!_product) _product = await this.productReferenceRepository.retrieveOne();
+        if (_product) _product = await this.productReferenceRepository.retrieveOne();
         return new Product(_product);
     }

[Timeout] ConditionalExpression
src/domain/useCase/generateUniqueProduct.useCase.ts:11:13
 
     async execute(product?: {name: string}) {
         let _product = product
-        if (!_product) _product = await this.productReferenceRepository.retrieveOne();
+        if (true) _product = await this.productReferenceRepository.retrieveOne();
         return new Product(_product);
     }
