[Timeout] BlockStatement
src/domain/useCase/retrieveMostExpensive.useCase.ts:9:60
     constructor() {
     }
 
-    async execute(vault: Vault): Promise<Product | string> {
-        if (!vault.getAll().length) return Promise.resolve(ErrorMessage.cartEmpty);
-        return Promise.resolve(vault.retrieveMostExpensive());
-    }
+    async execute(vault: Vault): Promise<Product | string> {}
 }
 

[Timeout] BooleanLiteral
src/domain/useCase/retrieveMostExpensive.useCase.ts:10:13
     }
 
     async execute(vault: Vault): Promise<Product | string> {
-        if (!vault.getAll().length) return Promise.resolve(ErrorMessage.cartEmpty);
+        if (vault.getAll().length) return Promise.resolve(ErrorMessage.cartEmpty);
         return Promise.resolve(vault.retrieveMostExpensive());
     }

[Timeout] ConditionalExpression
src/domain/useCase/retrieveMostExpensive.useCase.ts:10:13
     }
 
     async execute(vault: Vault): Promise<Product | string> {
-        if (!vault.getAll().length) return Promise.resolve(ErrorMessage.cartEmpty);
+        if (false) return Promise.resolve(ErrorMessage.cartEmpty);
         return Promise.resolve(vault.retrieveMostExpensive());
     }
