[Killed] BlockStatement
src/infra/repository/inMemoryProductReferenceRepository.ts:9:81
     private listProductReference: ProductReference[];
     private randomCalculator: RandomProductReferenceProvider;
 
-    constructor(randomProductReferenceProvider: RandomProductReferenceProvider) {
-        this.randomCalculator = randomProductReferenceProvider;
-    }
+    constructor(randomProductReferenceProvider: RandomProductReferenceProvider) {}
 
     retrieveOne(): Promise<ProductReference> {
killedBy: All tests
statusReason: > cart-tdd@1.0.0 test
> jest


PASS tests/units/retrieveMostExpensive.test.ts

PASS tests/units/buyProduct.test.ts

[Killed] BlockStatement
src/infra/repository/inMemoryProductReferenceRepository.ts:13:46
         this.randomCalculator = randomProductReferenceProvider;
     }
 
-    retrieveOne(): Promise<ProductReference> {
-        const random: number = this.randomCalculator.generate(this.listProductReference.length);
-        return Promise.resolve(this.listProductReference[random]);
-    }
+    retrieveOne(): Promise<ProductReference> {}
 
     feedWith(listProductReference: ProductReference[]) {
killedBy: All tests
statusReason: > cart-tdd@1.0.0 test
> jest


PASS tests/units/retrieveMostExpensive.test.ts

PASS tests/units/buyProduct.test.ts

[Killed] BlockStatement
src/infra/repository/inMemoryProductReferenceRepository.ts:18:56
         return Promise.resolve(this.listProductReference[random]);
     }
 
-    feedWith(listProductReference: ProductReference[]) {
-        this.listProductReference = listProductReference;
-    }
+    feedWith(listProductReference: ProductReference[]) {}
 }
 
killedBy: All tests
statusReason: > cart-tdd@1.0.0 test
> jest


PASS tests/units/retrieveMostExpensive.test.ts

PASS tests/units/buyProduct.test.ts
